.config/emacs/config.org
#+TITLE: Hankertrix's Emacs Config
#+AUTHOR: Hankertrix
#+DESCRIPTION: Hankertrix's personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Table Of Contents :toc:
- [[#important-programs][Important Programs]]
  - [[#elpaca-package-manager][Elpaca package manager]]
  - [[#key-bindings-with-general][Key bindings with General]]
  - [[#evil][Evil]]
  - [[#undo-system][Undo system]]
  - [[#which-key][Which Key]]
- [[#fonts][Fonts]]
- [[#emacs-settings][Emacs' settings]]
  - [[#gui-settings][GUI Settings]]
  - [[#error-bells][Error bells]]
  - [[#backups][Backups]]
  - [[#restoring-cursor-position][Restoring cursor position]]
  - [[#emacs-interface][Emacs Interface]]
  - [[#indentation-and-brackets][Indentation and brackets]]
  - [[#search][Search]]
- [[#whitespace-mode][Whitespace Mode]]
- [[#beautifying-emacs][Beautifying Emacs]]
  - [[#theme][Theme]]
  - [[#mode-line][Mode line]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#all-the-icons][All The Icons]]
  - [[#nerd-icons][Nerd Icons]]
- [[#miscellaneous][Miscellaneous]]
  - [[#zoom][Zoom]]
  - [[#file-previews-in-dired][File previews in Dired]]
- [[#development][Development]]
  - [[#lsp-mode][LSP mode]]
  - [[#flycheck][Flycheck]]
  - [[#completion-plugins][Completion plugins]]
  - [[#wgrep][Wgrep]]
- [[#embark][Embark]]
  - [[#integration-with-consult][Integration with consult]]
- [[#helpful][Helpful]]
- [[#git-integration][Git integration]]
- [[#org-mode][Org mode]]
  - [[#enable-the-table-of-contents][Enable the table of contents]]
  - [[#installing-org-modern][Installing Org Modern]]
  - [[#disabling-electric-indent][Disabling electric indent]]
  - [[#stopping-org-mode-from-indenting-2-spaces-in-code-blocks][Stopping org mode from indenting 2 spaces in code blocks]]
  - [[#enabling-org-tempo][Enabling Org Tempo]]
  - [[#stop-auto-completing--in-org-mode][Stop auto completing "<" in org mode]]
  - [[#add-a-page-break-immediately-after-the-table-of-contents-in-latex][Add a page break immediately after the table of contents in LaTeX]]
  - [[#evil-org][Evil Org]]
  - [[#turn-on-latex-syntax-highlighting-in-org-mode][Turn on LaTeX syntax highlighting in org mode]]
  - [[#add-syntax-highlighting-to-latex-exports-of-org-mode-code-blocks][Add syntax highlighting to LaTeX exports of org mode code blocks]]
  - [[#citeproc][Citeproc]]
  - [[#literate-programming][Literate programming]]
- [[#latex][LaTeX]]
  - [[#auctex][AUCTeX]]
  - [[#evil-tex][Evil TeX]]
  - [[#pdf-tools][PDF Tools]]
  - [[#revert-without-querying][Revert without querying]]
- [[#building-better-vim-habits][Building better Vim habits]]
  - [[#hardtime][Hardtime]]
- [[#external-programs][External programs]]
  - [[#language-servers][Language servers]]
  - [[#formatters-and-linters][Formatters and linters]]
  - [[#tex-and-latex][TeX and LaTeX]]
  - [[#miscellaneous-1][Miscellaneous]]

* Important Programs

** Elpaca package manager
Initialise Elpaca. This code is copied directly off of [[https://github.com/progfolio/elpaca][Elpaca's GitHub]].
#+begin_src emacs-lisp

(defvar elpaca-installer-version 0.9)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

#+end_src

Enable use-package support for Elpaca.
#+begin_src emacs-lisp

;; Install use-package support
(elpaca elpaca-use-package

  ;; Enable elpaca use-package keyword
  (elpaca-use-package-mode)

  ;; Assume :elpaca t and :ensure t unless otherwise specified
  (setq elpaca-use-package-by-default t))

;; Block until the above is done executing
(elpaca-wait)

#+end_src

