.config/emacs/config.org
** Key bindings with General
General has to be loaded first so that the ~use-package~ definitions below it can make use of the ~:general use-package~ keyword. Below are the key binds for built-in Emacs packages and modes.
#+begin_src emacs-lisp
(use-package general

  ;; Load general.el immediately to make use of
  ;; the :general use-package keyword
  :ensure (:wait t) :demand t

  ;; Configure general.el
  :config

  ;; Use the evil setup for general.el
  (general-evil-setup)

  ;; Key binds for the minibuffer
  (general-def
    :keymaps 'minibuffer-local-map
    "<escape>" '("Quit the minibuffer" . keyboard-escape-quit)
    )

  ;; Key binds for dired
  (general-def
    :states 'normal
    :keymaps 'dired-mode-map
    :major-modes 'dired-mode
    "_" '("Create a file" . find-file)
    )

  ;; Key binds for transient (used by Magit)
  (general-def
    :keymaps 'transient-base-map
    "<escape>" '("Quit transient" . transient-quit-one)
    )

  ;; Create a new definer for the leader keys
  (general-create-definer hanker/leader-keys

    ;; Set the leader key in all modes
    :states '(normal insert visual emacs)
    :keymaps 'override

    ;; Set the leader key to space
    :prefix "SPC"

    ;; Access leader key in insert mode using "Ctrl + Space"
    :global-prefix "C-SPC")

  ;; Key bindings involving the leader key

  ;; Key binds for BibTeX files
  (hanker/leader-keys
    :states 'normal
    :keymaps 'bibtex-mode-map
    :major-modes 'bibtex-mode
    "f" '("Format the BibTeX buffer" . bibtex-reformat))

  ;; Key binds for buffer management
  (hanker/leader-keys
    :states 'normal
    "l" '("Go to the next buffer" . next-buffer)
    "h" '("Go to the previous buffer" . previous-buffer)
    "x" '("Close the current buffer" . kill-this-buffer)
    )

  ;; Key binds for searching
  (hanker/leader-keys
    :states 'normal
    "pw" '("Open Dired" . dired)
    "pf" '("Search for a file" . find-file)
    )

  ;; Key binds for opening specific files
  (hanker/leader-keys
    :states 'normal
    "ec" '("Edit Emacs config" .
           (lambda () (interactive) (find-file "~/.config/emacs/config.org")))
    )

  ;; Key binds related to the terminal
  (hanker/leader-keys
    :states 'normal
    "te" '("Open a terminal" . (lambda ()
                                 (interactive)
                                 (evil-window-split)
                                 (term "bash"))))

  ;; Key binds in org mode
  (hanker/leader-keys
    :states 'normal
    :keymaps 'org-mode-map
    :major-modes 'org-mode
    "o" '(:ignore t :wk "Org mode keybinds")
    "oe" '("Org export dispatch" . org-export-dispatch)
    "oi" '("Org toggle item" . org-toggle-item)
    "oa" '("Org agenda" . org-agenda)
    "ot" '("Org todo" . org-todo-list)
    "ob" '(:ignore t :wk "Org babel keybinds")
    "obt" '("Org babel tangle" . org-babel-tangle)
    "obe" '("Org babel execute buffer" . org-babel-execute-buffer)
    )

  ;; Key binds for help files.
  ;; I'm using "/" because it is where the question mark is.
  ;; But I don't want to press shift to access the help files.
  (hanker/leader-keys
    :states 'normal
    "/" '(:ignore t :wk "Help")
    "/a" '("Open the apropos" . apropos)
    "/b" '("Describe bindings" . describe-bindings)
    "/c" '("Describe character under cursor" . describe-char)
    "/d" '(:ignore t :wk "Emacs documentation")
    "/da" '("About Emacs" . about-emacs)
    "/dd" '("View Emacs debugging" . view-emacs-debugging)
    "/df" '("View Emacs FAQ" . view-emacs-FAQ)
    "/dm" '("The Emacs manual" . info-emacs-manual)
    "/dn" '("View Emacs news" . view-emacs-news)
    "/do" '("How to obtain Emacs" . describe-distribution)
    "/dp" '("View Emacs problems" . view-emacs-problems)
    "/dt" '("View Emacs todo" . view-emacs-todo)
    "/dw" '("Show the COPYING file" . describe-no-warranty)
    "/e" '("View echo area messages" . view-echo-area-messages)
    "/f" '("Describe function" . describe-function)
    "/F" '("Describe face" . describe-face)
    "/g" '("Describe the GNU Project" . describe-gnu-project)
    "/i" '("Info" . info)
    "/I" '("Describe input method" . describe-input-method)
    "/k" '("Describe key" . describe-key)
    "/l" '("Display recent keystrokes and commands" . view-lossage)
    "/L" '("Describe language environment" . describe-language-environment)
    "/m" '("Describe mode" . describe-mode)
    "/r" '("Reload Emacs config" . (lambda () (interactive)
                                     (load-file "~/.config/emacs/init.el")
                                     (ignore (elpaca-process-queues))))
    "/t" '("Load theme" . load-theme)
    "/v" '("Describe variable" . describe-variable)
    "/w" '("Prints keybinding for command if set" . where-is)
    "/x" '("Display full documentation for command" . describe-command)
    )

  )
#+end_src

