.config/emacs/config.org
** Evil
Evil stands for extensible Vi layer for Emacs, which essentially just brings Vi and Vim key bindings to Emacs.
#+begin_src emacs-lisp
(use-package evil

  ;; Load the package immediately
  :demand t

  ;; Customise evil
  :custom

  ;; This is optional since it's already set to t (true) by default
  (evil-want-integration t)
  (evil-want-keybinding nil)

  ;; Open the new window on the right
  ;; when splitting vertically, just like in vim
  (evil-vsplit-window-right t)

  ;; Open the new window at the bottom
  ;; when splitting horizontally, just like in vim
  (evil-split-window-below t)

  ;; Use Ctrl + u to scroll up
  (evil-want-C-u-scroll t)

  ;; Set "Y" to yank till the end of the line
  (evil-want-Y-yank-to-eol t)

  ;; Make evil-search-word look for symbols rather than word boundaries
  (evil-symbol-word-search t)

  ;; Add the hook to enter insert mode when editing a commit
  :hook (git-commit-mode . evil-insert-state)

  ;; Function definitions that are used in the key bindings
  :init

  ;; Function to use a register with an evil function
  (defun hanker/use-register-with-evil-function (register evil-function)
    "A wrapper function to easily use a specified register REGISTER
     with an evil function EVIL-FUNCTION."
    (interactive)
    (let ((evil-this-register register))
      (call-interactively evil-function)))

  ;; Key binds for evil mode
  :general

  ;; Key binds in normal and visual mode
  (general-def
    :states '(normal visual)
    :keymaps 'override

    ;; Use Ctrl + hjkl to move between splits
    "C-h" '("Go to the window on the left" . evil-window-left)
    "C-j" '("Go to the window below" . evil-window-down)
    "C-k" '("Go to the window above" . evil-window-up)
    "C-l" '("Go to the window on the right" . evil-window-right)
    )

  ;; Key binds to copy and paste from the clipboard
  (hanker/leader-keys
    :states 'normal
    "P" '("Paste from the system clipboard before the cursor" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-paste-before)))
    "pp" '("Paste from the system clipboard after the cursor" .
           (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-paste-after)))
    "y" '("Copy to the system clipboard" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-yank)))
    "Y" '("Copy till the end of the line to the system clipboard" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-yank-line)))
    "d" '("Delete" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?_ 'evil-delete)))
    )

  ;; Unbind the Ctrl + n and the Ctrl + p
  ;; keys in the evil command line.
  ;;
  ;; This is so that I can use Ctrl + n
  ;; to get the completion item below
  ;; and Ctrl + p to get the completion
  ;; item above in the completion window,
  ;; instead of going through the command line history.
  :bind (:map evil-ex-completion-map
              ("C-n" . nil)
              ("C-p" . nil))

  ;; Configure evil mode
  :config

  ;; Set the undo system to Emacs' undo redo
  (evil-set-undo-system 'undo-redo)

  ;; The function to centre the screen on the current cursor position
  (defun hanker/centre-screen (&rest _)
    "Function to centre the screen on the current cursor position"
    (evil-scroll-line-to-center nil))

  ;; Centre the screen after every jump
  (dolist (func '(evil-search-next
                  evil-search-previous
                  evil-scroll-up
                  evil-scroll-down
                  evil-scroll-page-up
                  evil-scroll-page-down))
    (advice-add func :after #'hanker/centre-screen))

  ;; Enable evil mode
  (evil-mode))
#+end_src

*** Evil Collection
Evil collection is a collection of evil key bindings for various Emacs plugins.
#+begin_src emacs-lisp
(use-package evil-collection

  ;; Load the evil collection after evil
  :after evil

  ;; Use z for folds in magit
  :custom (evil-collection-magit-use-z-for-folds t)

  ;; Start evil collection
  :config (evil-collection-init))
#+end_src

*** Evil Goggles
Evil goggles highlights changes to text when deleting, replacing, copying or pasting text.
#+begin_src emacs-lisp
(use-package evil-goggles

  ;; Configure evil goggles
  :config

  ;; Use diff faces, which will cause deleted text to be highlighted
  ;; with the "diff-removed" face which is typically some red colour
  ;; Other faces such as "diff-added" will be used for other actions
  (evil-goggles-use-diff-faces)

  ;; Activate evil goggles mode
  (evil-goggles-mode))
#+end_src

*** Evil Nerd Commenter
Evil nerd commenter allows for easy commenting of code.
#+begin_src emacs-lisp
(use-package evil-nerd-commenter

  ;; Load evil nerd commenter only when its command is called
  :commands evilnc-comment-or-uncomment-lines

  ;; Comment out lines with Ctrl + /
  :general (general-def :states '(normal visual)
             "C-/" '("Comment out the selected lines" . evilnc-comment-or-uncomment-lines)))
#+end_src

*** Evil Surround
Evil surround allows for easily changing the surroundings of a text objects, such as changing from single quotes to double quotes. It is similar to [[https://github.com/tpope/vim-surround][vim-surround]], [[https://github.com/kylechui/nvim-surround][nvim-surround]] and [[https://github.com/machakann/vim-sandwich][vim-sandwich]].
#+begin_src emacs-lisp
(use-package evil-surround :after evil :config (global-evil-surround-mode 1))
#+end_src

*** Evil Anzu
Evil anzu highlights search terms. This package is required for doom modeline to display the match count when searching.
#+begin_src emacs-lisp
(use-package evil-anzu

  ;; Load evil anzu after evil
  :after evil

  ;; Set the search threshold for anzu
  :custom (anzu-search-threshold 1000)

  ;; Start anzu mode globally
  :config (global-anzu-mode t))
#+end_src

** Undo system
The built-in Emacs undo system is awesome, but doesn't have good UI and UX, so there's a need for some plugins to make it easier to use.

*** Undo Fu Session
Undo fu session is a plugin that persists undo and redo information.
#+begin_src emacs-lisp
(use-package undo-fu-session :demand t :config (undo-fu-session-global-mode))
#+end_src

*** Vundo
Vundo is short for visual undo, and it helps visualise the undo and redo history as a tree so it is easier to work with, just like the [[https://github.com/mbbill/undotree][undotree]] plugin for Vim.
#+begin_src emacs-lisp
(use-package vundo

  ;; Load vundo only when its command is called
  :commands vundo

  ;; Use pretty unicode glyphs to draw the tree
  :custom (vundo-glyph-alist vundo-unicode-symbols)

  ;; Keybinds for vundo
  :general
  (hanker/leader-keys
    :states 'normal
    "u" '("Open the undo tree window" . vundo))

  ;; Use escape to quit vundo as well
  (general-def
    :states 'normal
    :keymaps 'vundo-mode-map
    "<escape>" '("Close the undo tree window" . vundo-quit)))
#+end_src

*** Undo highlight
The ~undo-hl~ package is a simple package that highlights undos and redos.
#+begin_src emacs-lisp
(use-package undo-hl

  ;; Install the package from GitHub
  :ensure (undo-hl :host github :repo "casouri/undo-hl")

;; Enable undo highlight mode in text editing modes
  :hook ((prog-mode text-mode org-mode) . undo-hl-mode))
#+end_src

** Which Key
Which key is a plugin that displays the possible key binds and what each key bind does when you press a key.
#+begin_src emacs-lisp
(use-package which-key

  ;; Load the package immediately
  :demand t

  ;; Customise which key
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-max-display-columns nil)
  (which-key-min-display-lines 6)
  (which-key-side-window-slot -10)
  (which-key-side-window-max-height 0.25)
  (which-key-idle-delay 0.5)
  (which-key-max-description-length 25)
  (which-key-allow-imprecise-window-fit t)
  (which-key-separator " → ")

  ;; Start which key
  :config (which-key-mode 1))
#+end_src

* Fonts

Set the default font to Cascadia Code Nerd Font with a font size of 12.
# Set the default font to Maple Mono Nerd Font and a font size of 12.
#+begin_src emacs-lisp
(set-face-attribute 'default nil
                    :font "CaskaydiaCove Nerd Font Mono 12"
                    ;; :font "Maple Mono NF CN 12"
                    :weight 'medium)
#+end_src

Set the default mono space font to Cascadia Code Nerd Font with a font size of 12.
# Set the default mono space font to Maple Mono Nerd Font and a font size of 12.
#+begin_src emacs-lisp
(set-face-attribute 'fixed-pitch nil
                    :font "CaskaydiaCove Nerd Font Mono 12"
                    ;; :font "Maple Mono NF CN 12"
                    :weight 'medium)
#+end_src

Make comments italic.
#+begin_src emacs-lisp
(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
#+end_src

Set up the font such that it will work on emacsclient.
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(font . "CaskaydiaCove Nerd Font Mono 12"))
;; (add-to-list 'default-frame-alist '(font . "Maple Mono NF CN 12"))
#+end_src

* Emacs' settings

** GUI Settings

*** Splash Screen
Remove the startup splash screen.
#+begin_src emacs-lisp
(setq inhibit-startup-message t)
#+end_src

*** Padding
Have some padding before the edge of the screen.
#+begin_src emacs-lisp
(set-fringe-mode 5)
#+end_src

*** Menus
Disable the menu, the toolbar and the scroll bar.
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

Disable tool tips.
#+begin_src emacs-lisp
(tooltip-mode -1)
#+end_src

