.config/emacs/config.el

  ;; This is optional since it's already set to t (true) by default
  (evil-want-integration t)
  (evil-want-keybinding nil)

  ;; Open the new window on the right
  ;; when splitting vertically, just like in vim
  (evil-vsplit-window-right t)

  ;; Open the new window at the bottom
  ;; when splitting horizontally, just like in vim
  (evil-split-window-below t)

  ;; Use Ctrl + u to scroll up
  (evil-want-C-u-scroll t)

  ;; Set "Y" to yank till the end of the line
  (evil-want-Y-yank-to-eol t)

  ;; Make evil-search-word look for symbols rather than word boundaries
  (evil-symbol-word-search t)

  ;; Add the hook to enter insert mode when editing a commit
  :hook (git-commit-mode . evil-insert-state)

  ;; Function definitions that are used in the key bindings
  :init

  ;; Function to use a register with an evil function
  (defun hanker/use-register-with-evil-function (register evil-function)
    "A wrapper function to easily use a specified register REGISTER
     with an evil function EVIL-FUNCTION."
    (interactive)
    (let ((evil-this-register register))
      (call-interactively evil-function)))

  ;; Key binds for evil mode
  :general

  ;; Key binds in normal and visual mode
  (general-def
    :states '(normal visual)
    :keymaps 'override

    ;; Use Ctrl + hjkl to move between splits
    "C-h" '("Go to the window on the left" . evil-window-left)
    "C-j" '("Go to the window below" . evil-window-down)
    "C-k" '("Go to the window above" . evil-window-up)
    "C-l" '("Go to the window on the right" . evil-window-right)
    )

  ;; Key binds to copy and paste from the clipboard
  (hanker/leader-keys
    :states 'normal
    "P" '("Paste from the system clipboard before the cursor" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-paste-before)))
    "pp" '("Paste from the system clipboard after the cursor" .
           (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-paste-after)))
    "y" '("Copy to the system clipboard" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-yank)))
    "Y" '("Copy till the end of the line to the system clipboard" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?+ 'evil-yank-line)))
    "d" '("Delete" .
          (lambda () (interactive) (hanker/use-register-with-evil-function ?_ 'evil-delete)))
    )

  ;; Configure evil mode
  :config

  ;; Set the undo system to Emacs' undo redo
  (evil-set-undo-system 'undo-redo)

  ;; The function to centre the screen on the current cursor position
  (defun hanker/centre-screen (&rest _)
    "Function to centre the screen on the current cursor position"
    (evil-scroll-line-to-center nil))

  ;; Centre the screen after every jump
  (dolist (func '(evil-search-next
                  evil-search-previous
                  evil-scroll-up
                  evil-scroll-down
                  evil-scroll-page-up
                  evil-scroll-page-down))
    (advice-add func :after #'hanker/centre-screen))

  ;; Enable evil mode
  (evil-mode))

(use-package evil-collection

  ;; Load the evil collection after evil
  :after evil

  ;; Use z for folds in magit
  :custom (evil-collection-magit-use-z-for-folds t)

  ;; Start evil collection
  :config (evil-collection-init))

(use-package evil-goggles

  ;; Configure evil goggles
  :config

  ;; Use diff faces, which will cause deleted text to be highlighted
  ;; with the "diff-removed" face which is typically some red colour
  ;; Other faces such as "diff-added" will be used for other actions
  (evil-goggles-use-diff-faces)

  ;; Activate evil goggles mode
  (evil-goggles-mode))

(use-package evil-nerd-commenter

  ;; Load evil nerd commenter only when its command is called
  :commands evilnc-comment-or-uncomment-lines

  ;; Comment out lines with Ctrl + /
  :general (general-def :states '(normal visual)
             "C-/" '("Comment out the selected lines" . evilnc-comment-or-uncomment-lines)))

(use-package evil-surround :after evil :config (global-evil-surround-mode 1))

(use-package evil-anzu

  ;; Load evil anzu after evil
  :after evil

  ;; Set the search threshold for anzu
  :custom (anzu-search-threshold 1000)

  ;; Start anzu mode globally
  :config (global-anzu-mode t))

(use-package undo-fu-session :demand t :config (undo-fu-session-global-mode))

(use-package vundo

  ;; Load vundo only when its command is called
  :commands vundo

  ;; Use pretty unicode glyphs to draw the tree
  :custom (vundo-glyph-alist vundo-unicode-symbols)

  ;; Keybinds for vundo
  :general
  (hanker/leader-keys
    :states 'normal
    "u" '("Open the undo tree window" . vundo))

  ;; Use escape to quit vundo as well
  (general-def
    :states 'normal
    :keymaps 'vundo-mode-map
    "<escape>" '("Close the undo tree window" . vundo-quit)))

(use-package which-key

  ;; Load which key immediately
  :demand t

  ;; Customise which key
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-max-display-columns nil)
  (which-key-min-display-lines 6)
  (which-key-side-window-slot -10)
  (which-key-side-window-max-height 0.25)
  (which-key-idle-delay 0.5)
  (which-key-max-description-length 25)
  (which-key-allow-imprecise-window-fit t)
  (which-key-separator " → ")

  ;; Start which key
  :config (which-key-mode 1))

(set-face-attribute 'default nil
                    :font "CaskaydiaCove Nerd Font Mono 12"
                    ;; :font "Maple Mono NF CN 12"
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "CaskaydiaCove Nerd Font Mono 12"
                    ;; :font "Maple Mono NF CN 12"
                    :weight 'medium)

(set-face-attribute 'font-lock-comment-face nil :slant 'italic)

(add-to-list 'default-frame-alist '(font . "CaskaydiaCove Nerd Font Mono 12"))
;; (add-to-list 'default-frame-alist '(font . "Maple Mono NF CN 12"))

(setq inhibit-startup-message t)

(set-fringe-mode 5)

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

(tooltip-mode -1)
