.config/emacs/config.org
*** Show the maximum column width
This shows a column on the right that marks the maximum number of characters you should have in a line. This is enabled only when programming since there's no need for it when writing text.
#+begin_src emacs-lisp

;; Set the fill column to 80
(setq-default fill-column 80)

;; Enable the fill column display in programming mode
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
#+end_src

** Error bells
Disable all error bells.
#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)
#+end_src

** Backups
Don't create backups.
#+begin_src emacs-lisp
(setq make-backup-files nil)
#+end_src

** Restoring cursor position
Enable ~save-place-mode~ to restore the last cursor position when opening a file.
#+begin_src emacs-lisp
(save-place-mode)
#+end_src

** Emacs Interface

*** Line numbers
Display relative line numbers.
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)
#+end_src

Disable line numbers for some modes, specifically terminal, E-shell and PDF view mode.
#+begin_src emacs-lisp
(dolist (mode '(term-mode-hook
                eshell-mode-hook
                pdf-view-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

*** Column numbers
Display column numbers on the mode line.
#+begin_src emacs-lisp
(column-number-mode)
#+end_src

*** Scrolling
Set the scroll margin (scrolloff in vim) and the scroll step to have vim-like scrolling.
#+begin_src emacs-lisp
(setq scroll-margin 8)
(setq scroll-step 1)
#+end_src

*** Line wrap
Wrap long lines.
#+begin_src emacs-lisp
(global-visual-line-mode t)
#+end_src

** Indentation and brackets

*** Indentation
Use spaces instead of tabs for indentation.
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src

Set a default indentation of 4 spaces.
#+begin_src emacs-lisp
(setq-default tab-width 4)
(setq-default evil-shift-width tab-width)
#+end_src

*** Auto close brackets
Electric pair mode is a mode to auto close brackets.
#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src

** Search
Make Dabbrev completions case-sensitive.
#+begin_src emacs-lisp
(setq dabbrev-case-fold-search nil)
#+end_src

* Whitespace Mode
Set up whitespace mode to show trailing spaces, non-breaking spaces, new lines, indentation, and mixed indentation.
#+begin_src emacs-lisp
(setq whitespace-style '(

                         ;; Enable highlighting of whitespace
                         face

                         ;; Show tabs
                         tabs

                         ;; Show trailing spaces
                         trailing

                         ;; Show indentation
                         indentation

                         ;; Show mixed indentation
                         space-before-tab
                         space-after-tab

                         ;; Show spaces using a special character
                         space-mark

                         ;; Show tabs using a special character
                         tab-mark

                         ;; Show new lines using a special character
                         newline-mark))
#+end_src

Set up whitespace mode to show new lines and non-breaking spaces.
#+begin_src emacs-lisp
(setq whitespace-display-mappings

      ;; Non-breaking spaces are displayed as ‡
      ;; Fall back to underscores if ‡ cannot be displayed
      '((space-mark ?\xA0 [?‡] [?_])

        ;; New lines are displayed as ↵
        ;; Fall back to the dollar sign symbol if ↵ cannot be displayed
        (newline-mark ?\n [?↵ ?\n] [?$ ?\n])

        ;; Carriage return (Windows) are displayed as ¶
        ;; Fall back to the hash symbol if ¶ cannot be displayed
        (newline-mark ?\r [?¶] [?#])

        ;; Tabs are displayed as ⇥
        ;; Fall back to the greater than symbol if ⇥ cannot be displayed
        (tab-mark ?\t [?⇥ ?\t] [?> ?\t])))
#+end_src

Show trailing white space.
#+begin_src emacs-lisp
(setq-default show-trailing-whitespace t)
#+end_src

Disable whitespace mode in buffers that don't need it.
#+begin_src emacs-lisp
(setq-default whitespace-global-modes
              '(not shell-mode
                    help-mode
                    magit-mode
                    magit-diff-mode
                    ibuffer-mode
                    dired-mode
                    occur-mode
                    elpaca-log-mode
                    elpaca-ui-mode
                    elpaca-ui-live-update-mode
                    fundamental-mode))
#+end_src

Setup clean up actions for whitespace mode. The configuration below will remove all empty lines at the beginning and end of the buffer, and also remove all trailing tabs and spaces.
#+begin_src emacs-lisp
(setq-default whitespace-action
              '(cleanup auto-cleanup))
#+end_src

Enable whitespace mode.
#+begin_src emacs-lisp
(global-whitespace-mode 1)
#+end_src

* Beautifying Emacs

** Theme
Install doom themes for the Bluloco dark theme inside doom themes. The Bluloco dark theme is an excellent high contrast theme that I use pretty much everywhere because it has a heck ton of colours which makes everything stand out. It works great with a red-shifter too.
#+begin_src emacs-lisp
(use-package doom-themes

  ;; Customise doom themes
  :custom

  ;; Enable bold and italic fonts for doom themes
  (doom-themes-enable-bold t)
  (doom-themes-enable-italics t)

  ;; Corrects and improves org-mode's native fontification
  :config (doom-themes-org-config))
#+end_src

Install the Auto-Dark Emacs package to automatically switch between light and dark themes.
#+begin_src emacs-lisp
(use-package auto-dark

  ;; Ensure that doom-themes is installed
  :after doom-themes

  ;; Load the package immediately
  :demand t

  ;; Customise the auto dark package
  :custom

  ;; Set the dark theme and light theme.
  ;; The first theme is when dark mode is active,
  ;; and the second theme is when light mode is active.
  (auto-dark-themes '((doom-bluloco-dark) (doom-bluloco-light)))

  ;; Start auto dark mode
  :config (auto-dark-mode))
#+end_src

** Mode line
Use doom mode line for the Emacs mode line.
#+begin_src emacs-lisp
(use-package doom-modeline :demand t :config (doom-modeline-mode 1))
#+end_src

** Rainbow Delimiters
This is to make it easier to see the different brackets as lisp has a heck ton of brackets.
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** All The Icons
All the icons is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
#+begin_src emacs-lisp

;; Install the all the icons package
(use-package all-the-icons

  ;; Only load the package if the interface is graphical and not a terminal
  :if (display-graphic-p))

;; Install the all the icons package for dired and enable it in dired mode
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

** Nerd Icons
Nerd Icons is another icon set that can be used with anything in Emacs. I am currently using it through kind-icons with Corfu.
#+begin_src emacs-lisp
(use-package nerd-icons

  ;; Customise nerd icons
  :custom

  ;; Set the font to Cascadia Code nerd font
  (nerd-icons-font-family "CaskaydiaCove NFM")

  ;; Set the font to Maple Mono NF CN
  ;; (nerd-icons-font-family "Maple Mono NF CN")

  )
#+end_src

* Miscellaneous

** Zoom
Set Ctrl plus =/- for zooming in/out.
#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
#+end_src

Set Ctrl + the mouse wheel to zoom in and out.
#+begin_src emacs-lisp
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** File previews in Dired
Use Dired preview to preview files in Dired.
#+begin_src emacs-lisp
(use-package dired-preview

  ;; Show the preview immediately
  :custom (dired-preview-delay 0.0)

  ;; Configure dired preview
  :config

  ;; Enable dired preview globally
  (dired-preview-global-mode 1))
#+end_src

* Development

