.config/emacs/config.el

;; Set the fill column to 80
(setq-default fill-column 80)

;; Enable the fill column display in programming mode
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)

(setq ring-bell-function 'ignore)

(setq make-backup-files nil)

(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)

(dolist (mode '(term-mode-hook
                eshell-mode-hook
                pdf-view-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(column-number-mode)

(setq scroll-margin 8)
(setq scroll-step 1)

(global-visual-line-mode t)

(setq-default indent-tabs-mode nil)

(setq-default tab-width 4)
(setq-default evil-shift-width tab-width)

(electric-pair-mode 1)

(setq dabbrev-case-fold-search nil)

(setq whitespace-style '(

                         ;; Enable highlighting of whitespace
                         face

                         ;; Show tabs
                         tabs

                         ;; Show trailing spaces
                         trailing

                         ;; Show indentation
                         indentation

                         ;; Show mixed indentation
                         space-before-tab
                         space-after-tab

                         ;; Show spaces using a special character
                         space-mark

                         ;; Show tabs using a special character
                         tab-mark

                         ;; Show new lines using a special character
                         newline-mark))

(setq whitespace-display-mappings

      ;; Non-breaking spaces are displayed as ‡
      ;; Fall back to underscores if ‡ cannot be displayed
      '((space-mark ?\xA0 [?‡] [?_])

        ;; New lines are displayed as ↵
        ;; Fall back to the dollar sign symbol if ↵ cannot be displayed
        (newline-mark ?\n [?↵ ?\n] [?$ ?\n])

        ;; Carriage return (Windows) are displayed as ¶
        ;; Fall back to the hash symbol if ¶ cannot be displayed
        (newline-mark ?\r [?¶] [?#])

        ;; Tabs are displayed as ⇥
        ;; Fall back to the greater than symbol if ⇥ cannot be displayed
        (tab-mark ?\t [?⇥ ?\t] [?> ?\t])))

(setq-default show-trailing-whitespace t)

(setq-default whitespace-global-modes
              '(not shell-mode
                    help-mode
                    magit-mode
                    magit-diff-mode
                    ibuffer-mode
                    dired-mode
                    occur-mode
                    elpaca-log-mode
                    elpaca-ui-mode
                    elpaca-ui-live-update-mode
                    fundamental-mode))

(setq-default whitespace-action
              '(cleanup auto-cleanup))

(global-whitespace-mode 1)

(use-package doom-themes

  ;; Customise doom themes
  :custom

  ;; Enable bold and italic fonts for doom themes
  (doom-themes-enable-bold t)
  (doom-themes-enable-italics t)

  ;; Corrects and improves org-mode's native fontification
  :config (doom-themes-org-config))

(use-package auto-dark

  ;; Ensure that doom-themes is installed
  :after doom-themes

  ;; Load auto dark mode immediately
  :demand t

  ;; Customise the auto dark package
  :custom

  ;; Set the dark theme and light theme.
  ;; The first theme is when dark mode is active,
  ;; and the second theme is when light mode is active.
  (auto-dark-themes '((doom-bluloco-dark) (doom-bluloco-light)))

  ;; Start auto dark mode
  :config (auto-dark-mode))

(use-package doom-modeline :demand t :config (doom-modeline-mode 1))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; Install the all the icons package
(use-package all-the-icons

  ;; Only load the package if the interface is graphical and not a terminal
  :if (display-graphic-p))

;; Install the all the icons package for dired and enable it in dired mode
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package nerd-icons

  ;; Customise nerd icons
  :custom

  ;; Set the font to Cascadia Code nerd font
  (nerd-icons-font-family "CaskaydiaCove NFM")

  ;; Set the font to Maple Mono NF CN
  ;; (nerd-icons-font-family "Maple Mono NF CN")

  )

(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)

(use-package dired-preview

  ;; Show the preview immediately
  :custom (dired-preview-delay 0.0)

  ;; Configure dired preview
  :config

  ;; Enable dired preview globally
  (dired-preview-global-mode 1))
