.config/emacs/config.el

(use-package lsp-mode

  ;; Load LSP mode only when its commands are called
  :commands (lsp lsp-deferred)

  ;; Customise LSP mode
  :custom

  ;; Set the prefix for LSP mode key binds.
  ;;
  ;; I have custom keybinds for LSP mode
  ;; so this is just a fallback for LSP mode
  ;; functions that I haven't mapped a key for.
  (lsp-keymap-prefix "C-'")

  ;; Disable snippet support for LSP mode
  (lsp-enable-snippet nil)

  ;; Disable the LSP completion provider
  ;; as Corfu is used instead
  (lsp-completion-provider :none)

  ;; Set up the headerline in LSP mode
  (lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))

  ;; The hooks for LSP mode
  :hook

  ;; Start LSP headerline breadcrumb mode when LSP mode is enabled
  (lsp-mode . lsp-headerline-breadcrumb-mode)

  ;; Disable LSP mode integration with completion at point functions in text mode.
  ;; This is to get autocompletions with Corfu and Cape working again in text mode.
  (text-mode . (lambda () (setq-local lsp-completion-enable nil)))

  ;; Configure LSP mode
  :config

  ;; Enable which key integration for LSP mode
  (lsp-enable-which-key-integration t)

  ;; Register the efm language server
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection "efm-langserver")

                    ;; So far, only Ruff is being used,
                    ;; so only activate the server in Python mode
                    :activation-fn (lsp-activate-on "python")
                    :server-id 'efm))

  ;; Ensure that efm language server is installed
  :ensure-system-package (efm-langserver . "yay -S efm-langserver"))

(use-package lsp-ui

  ;; Start the UI when LSP mode is started
  :hook (lsp-mode . lsp-ui-mode)

  ;; Customise the UI
  :custom

  ;; Set the position of the documentation to be at the cursor position
  (lsp-ui-doc-position 'at-point)

  ;; Keybinds for LSP mode
  :general

  ;; Key binds for normal mode in LSP mode
  (general-def
    :keymaps 'lsp-mode-map
    :states 'normal
    "K" '("Describe the currently hovered item" . lsp-ui-doc-glance)
    "gd" '("Go to definition" . lsp-ui-peek-find-definitions)
    "gD" '("Go to declaration" . lsp-find-declaration)
    "gi" '("List all implementations" . lsp-ui-peek-find-implementation)
    "go" '("Go to type definition" . lsp-find-type-definition)
    "gr" '("List all references" . lsp-ui-peek-find-references)
    "gs" '("Show signature information" . lsp-signature-activate)
    "<f2>" '("Renames all references to the symbol under the cursor" . lsp-rename)
    "<f3>" '("Formats the buffer using the LSP" . lsp-format-buffer)
    "SPC f" '("Formats the buffer using the LSP" . lsp-format-buffer)
    "<f4>" '("Select a code action" . lsp-execute-code-action)

    ;; Key binds for visual mode in LSP mode
    (general-def
      :keymaps 'lsp-mode-map
      :states 'visual
      "<f3>" '("Formats the region using the LSP" . lsp-format-region)
      "SPC f" '("Formats the region using the LSP" . lsp-format-region)
      )
    )
  )

(use-package lua-mode)
(use-package haskell-mode)
(use-package rust-mode

  ;; Initialise the treesitter
  :custom (rust-mode-treesitter-derive t)

  ;; Enable the lsp when in rust mode
  :hook (rust-mode . lsp-deferred))

(use-package lsp-ltex-plus

  ;; Install lsp-ltex-plus from GitHub
  :ensure (lsp-ltex-plus :host github :repo "emacs-languagetool/lsp-ltex-plus")

  ;; Ensure LTEX+ exists
  :ensure-system-package (ltex-ls-plus . "yay -S ltex-ls-plus-bin")

  ;; Customise LTEX+
  :custom

  ;; Set the language for LTEX+ to British English
  (lsp-ltex-plus-language "en-GB")

  ;; Disable the oxford spelling rule
  (lsp-ltex-plus-disabled-rules '(:en-GB ["OXFORD_SPELLING_Z_NOT_S"]))

  ;; Set the wanted LTEX+ version to the latest version
  (lsp-ltex-plus-version "18.4.0")

  ;; Enable LTEX+ in text mode
  :hook (text-mode . (lambda ()
                       (require 'lsp-ltex-plus)
                       (lsp-deferred))))

(use-package lsp-pyright

  ;; Ensure basedpyright exists
  :ensure-system-package (basedpyright . "yay -S basedpyright")

  ;; Customise lsp-pyright
  :custom

  ;; Use basedpyright
  (lsp-pyright-langserver-command "basedpyright")

  ;; Disable organising imports for lsp-pyright
  (lsp-pyright-disable-organize-imports t)

  ;; Activate lsp-pyright in Python mode
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp-deferred))))

(use-package flycheck

  ;; Load flycheck immediately
  :demand t

  ;; Key binds for flycheck
  :general

  (hanker/leader-keys
    :states 'normal
    :keymaps 'flycheck-mode-map
    :major-modes 'flycheck-mode
    "tr" '("List all the errors in the current buffer" . flycheck-list-errors)
    "tb" '("List all the errors in the current buffer" . flycheck-list-errors)
    )

  ;; Start flycheck globally
  :config (global-flycheck-mode))

(use-package vertico

  ;; Include vertico extensions
  :ensure (vertico :host github :repo "minad/vertico" :files (:defaults "extensions/*"))

  ;; Load vertico immediately
  :demand t

  ;; Hooks for vertico
  :hook

  ;; Clean up the file path when typing
  (rfn-eshadow-update-overlay . vertico-directory-tidy)

  ;; Make sure that vertico state is saved
  (minibuffer-setup . vertico-repeat-save)

  ;; Customise vertico
  :custom

  ;; Resize vertico
  (vertico-resize t)

  ;; Cycle from bottom to top
  (vertico-cycle t)

  ;; Extensions customisations

  ;; Customise the grid view
  (vertico-grid-separator "       ")
  (vertico-grid-lookahead 50)

  ;; Customise the buffer display action
  (vertico-buffer-display-action '(display-buffer-reuse-window))

  ;; Set the layouts for vertico in different modes
  (vertico-multiform-categories
   '((file reverse)
     (consult-grep buffer)
     (consult-location)
     (imenu buffer)
     (library reverse indexed)
     (org-roam-node reverse indexed)
     (t reverse)
     ))

  ;; Set the layouts for vertico in different commands
  (vertico-multiform-commands
   '(("flyspell-correct-*" grid reverse)
     (org-refile grid reverse indexed)
     (consult-yank-pop indexed)
     (consult-flycheck)
     (consult-lsp-diagnostics)
     ))

  ;; Configure vertico
  :config

  ;; Prefix the current candidate with an arrow
  ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
  (defvar +vertico-current-arrow t)

  (cl-defmethod vertico--format-candidate :around
    (cand prefix suffix index start &context ((and +vertico-current-arrow
                                                   (not (bound-and-true-p vertico-flat-mode)))
                                              (eql t)))
    (setq cand (cl-call-next-method cand prefix suffix index start))
    (if (bound-and-true-p vertico-grid-mode)
        (if (= vertico--index index)
            (concat #("▶" 0 1 (face vertico-current)) cand)
          (concat #("_" 0 1 (display " ")) cand))
      (if (= vertico--index index)
          (concat
           #(" " 0 1 (display (left-fringe right-triangle vertico-current)))
           cand)
        cand)))

  ;; Start vertico
  (vertico-mode)

  ;; Start vertico multiform mode
  (vertico-multiform-mode))
