.config/emacs/config.org
*** Marginalia
Marginalia is a plugin that adds annotations to the mini-buffer, like file permissions for example. It is the Vertico alternative to Ivy Rich, but can be used with other plugins as well, not just Vertico.
#+begin_src emacs-lisp
(use-package marginalia

  ;; Load the package immediately
  :demand t

  ;; Add a key bind to cycle the marginalia annotations
  :general (general-def
             :keymaps 'minibuffer-local-map
             "M-a" 'marginalia-cycle)

  ;; Customise marginalia
  :custom

  ;; Never show a relative age
  ;; for the file annotator
  (marginalia-max-relative-age 0)

  ;; Add marginalia at the right side
  (marginalia-align 'right)

  ;; Start marginalia mode
  :config (marginalia-mode))
#+end_src

*** Nerd icons completion
Nerd icons completion is a plugin that displays pretty icons alongside the marginalia annotations using nerd icons. It is the Vertico alternative to the all the icons ivy rich package, but with nerd icons.
#+begin_src emacs-lisp
(use-package nerd-icons-completion

  ;; Load nerd icons completion after marginalia
  :after marginalia

  ;; Load the package immediately
  :demand t

  ;; Set up nerd icons with marginalia
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)

  ;; Start nerd icons completion
  :config (nerd-icons-completion-mode))
#+end_src

*** Orderless
Orderless is essentially fuzzy matching for Emacs completion plugins, like ~fzf~. It doesn't work exactly like ~fzf~ or other fuzzy finders though, it is only somewhat fuzzy and depends on delimiters like spaces to fuzzy match.
#+begin_src emacs-lisp
(use-package orderless

  ;; Customise orderless
  :custom

  ;; Use partial completion and basic as fallback styles
  (completion-styles '(orderless partial-completion basic))

  ;; Don't use orderless with remote files
  (completion-category-overrides '((file (styles basic partial-completion))))

  ;; Function to set the orderless completion style in LSP mode
  :init (defun hanker/orderless-lsp-completion-mode-setup ()
    "Function to set the LSP completion style to orderless"

    ;; Set up completion with Corfu with the orderless style
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless)))

  ;; Set up orderless completion in LSP completion mode
  :hook (lsp-completion-mode . hanker/orderless-lsp-completion-mode-setup))
#+end_src

*** Consult
Consult is a plugin that consults Emacs' completing-read functions for you to pick one from. It is essentially a picker for Emacs' completing-read functions.
#+begin_src emacs-lisp
(use-package consult

  ;; Make sure ripgrep is installed
  :ensure-system-package (rg . "sudo pacman -S ripgrep")

  ;; Load consult only when its commands are called
  :commands ( consult-info consult-man consult-ripgrep
              consult-buffer consult-register-load consult)

  ;; Key maps for consult
  :general

  ;; Key maps
  (general-def :states 'normal
    "<f1>" '("Search the info pages" . consult-info))

  ;; Leader key maps
  (hanker/leader-keys
    :states 'normal
    "/i" '("Search the info pages" . consult-info)
    "/h" '("Search the info pages" . consult-info)
    "ps" '("Search within files for a string" . consult-ripgrep)
    "pb" '("Search through the open buffers" . consult-buffer)
    "pr" '("Search through Emacs registers" . consult-register-load)
    "pl" '("Search through the lines in the current buffer" . consult-line)

    ;; https://emacs.stackexchange.com/questions/82850/call-execute-extended-command-with-prefilled-prefix-string
    "pi" '("Search through the list of pickers" .
           (lambda ()
             (interactive)
             (command-execute (intern (completing-read "Picker: " obarray #'commandp t '("consult-" . 8))))))
    )
  )
#+end_src

**** Consult Dir
Consult Dir stands for consult directory, which helps you easily add file and directory paths into the mini buffer. It can also be used elsewhere, but it is most helpful in the mini buffer.
#+begin_src emacs-lisp
(use-package consult-dir

  ;; Load consult-dir only when its commands are called
  :commands (consult-dir consult-dir-jump-file)

  ;; Key binds for consult-dir
  :general

  ;; Key binds to apply everywhere
  (general-def
    "M-d" '("Insert a directory path into the current buffer" . consult-dir))

  ;; Mini buffer key maps
  (general-def
    :keymaps 'vertico-map
    "M-d" '("Insert a directory path into the current buffer" . consult-dir)
    "M-D" '("Jump to file from the directory in the mini buffer prompt" . consult-dir-jump-file)))
#+end_src

*** Corfu
Corfu is a plugin for in-buffer completions.
#+begin_src emacs-lisp
(use-package corfu

  ;; Include corfu extensions
  :ensure (corfu :host github :repo "minad/corfu" :files (:defaults "extensions/*"))

  ;; Load the package immediately
  :demand t

  ;; Customise corfu
  :custom

  ;; Allows cycling through candidates
  (corfu-cycle t)

  ;; Enable auto completion
  (corfu-auto t)

  ;; Only auto complete when there are 2 letters or more
  (corfu-auto-prefix 2)

  ;; Preselect the first candidate
  (corfu-preselect-first t)

  ;; Stop auto completing when there is a separator like a space
  (corfu-quit-at-boundary 'separator)

  ;; Always quit when there is no match
  (corfu-quit-no-match t)

  ;; Don't show the documentation for the completion.
  ;; I am using corfu-popupinfo-mode for the documentation instead.
  (corfu-echo-documentation nil)

  ;; Set the delay to display the documentation to 250 milliseconds.
  ;; This has the same value as my Neovim configuration.
  (corfu-popupinfo-delay 0.25)

  ;; Insert the candidate when previewing
  (corfu-preview-current 'insert)

  ;; Disable the return key
  :bind (:map corfu-map ("RET" . nil))

  ;; Function to enable corfu in the minibuffer
  ;; if other completion plugins are not active
  :init (defun hanker/corfu-always-enable-in-minibuffer ()
          "Enable Corfu in the minibuffer if Vertico/Mct are not active."
          (unless (or (bound-and-true-p mct--active)
                      (bound-and-true-p vertico--input)
                      (eq (current-local-map) read-passwd-map))

            ;; Disable automatic echo and popup
            (setq-local corfu-echo-delay nil
                        corfu-popupinfo-delay nil)

            ;; Enable corfu
            (corfu-mode)))

  ;; Enable corfu in the minibuffer
  ;; if other completion plugins are not active
  :hook (minibuffer-setup . hanker/corfu-always-enable-in-minibuffer)

  ;; Configure corfu
  :config

  ;; Enable corfu everywhere
  (global-corfu-mode)

  ;; Show documentation using the corfu pop up info extension
  (corfu-popupinfo-mode)

  ;; Save completion history for better sorting
  (corfu-history-mode)
  (savehist-mode)
  (add-to-list 'savehist-additional-variables 'corfu-history))
#+end_src

