.config/emacs/config.el

(use-package marginalia

  ;; Load marginalia immediately
  :demand t

  ;; Add a key bind to cycle the marginalia annotations
  :general (general-def
             :keymaps 'minibuffer-local-map
             "M-a" 'marginalia-cycle)

  ;; Customise marginalia
  :custom

  ;; Never show a relative age
  ;; for the file annotator
  (marginalia-max-relative-age 0)

  ;; Add marginalia at the right side
  (marginalia-align 'right)

  ;; Start marginalia mode
  :config (marginalia-mode))

(use-package nerd-icons-completion

  ;; Load nerd icons completion after marginalia
  :after marginalia

  ;; Load nerd icons completion immediately
  :demand t

  ;; Set up nerd icons with marginalia
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)

  ;; Start nerd icons completion
  :config (nerd-icons-completion-mode))

(use-package orderless

  ;; Customise orderless
  :custom

  ;; Use partial completion and basic as fallback styles
  (completion-styles '(orderless partial-completion basic))

  ;; Don't use orderless with remote files
  (completion-category-overrides '((file (styles basic partial-completion))))

  ;; Function to set the orderless completion style in LSP mode
  :init (defun hanker/orderless-lsp-completion-mode-setup ()
    "Function to set the LSP completion style to orderless"

    ;; Set up completion with Corfu with the orderless style
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless)))

  ;; Set up orderless completion in LSP completion mode
  :hook (lsp-completion-mode . hanker/orderless-lsp-completion-mode-setup))

(use-package consult

  ;; Make sure ripgrep is installed
  :ensure-system-package (rg . "sudo pacman -S ripgrep")

  ;; Load consult only when its commands are called
  :commands ( consult-info consult-man consult-ripgrep
              consult-buffer consult-register-load consult)

  ;; Key maps for consult
  :general

  ;; Key maps
  (general-def :states 'normal
    "<f1>" '("Search the info pages" . consult-info))

  ;; Leader key maps
  (hanker/leader-keys
    :states 'normal
    "/i" '("Search the info pages" . consult-info)
    "/h" '("Search the info pages" . consult-info)
    "ps" '("Search within files for a string" . consult-ripgrep)
    "pb" '("Search through the open buffers" . consult-buffer)
    "pr" '("Search through Emacs registers" . consult-register-load)
    "pl" '("Search through the lines in the current buffer" . consult-line)

    ;; https://emacs.stackexchange.com/questions/82850/call-execute-extended-command-with-prefilled-prefix-string
    "pi" '("Search through the list of pickers" .
           (lambda ()
             (interactive)
             (command-execute (intern (completing-read "Picker: " obarray #'commandp t '("consult-" . 8))))))
    )
  )

(use-package consult-dir

  ;; Load consult-dir only when its commands are called
  :commands (consult-dir consult-dir-jump-file)

  ;; Key binds for consult-dir
  :general

  ;; Key binds to apply everywhere
  (general-def
    "M-d" '("Insert a directory path into the current buffer" . consult-dir))

  ;; Mini buffer key maps
  (general-def
    :keymaps 'vertico-map
    "M-d" '("Insert a directory path into the current buffer" . consult-dir)
    "M-D" '("Jump to file from the directory in the mini buffer prompt" . consult-dir-jump-file)))

(use-package corfu

  ;; Include corfu extensions
  :ensure (corfu :host github :repo "minad/corfu" :files (:defaults "extensions/*"))

  ;; Load corfu immediately
  :demand t

  ;; Customise corfu
  :custom

  ;; Allows cycling through candidates
  (corfu-cycle t)

  ;; Enable auto completion
  (corfu-auto t)

  ;; Only auto complete when there are 2 letters or more
  (corfu-auto-prefix 2)

  ;; Preselect the first candidate
  (corfu-preselect-first t)

  ;; Stop auto completing when there is a separator like a space
  (corfu-quit-at-boundary 'separator)

  ;; Always quit when there is no match
  (corfu-quit-no-match t)

  ;; Don't show the documentation for the completion.
  ;; I am using corfu-popupinfo-mode for the documentation instead.
  (corfu-echo-documentation nil)

  ;; Set the delay to display the documentation to 250 milliseconds.
  ;; This has the same value as my Neovim configuration.
  (corfu-popupinfo-delay 0.25)

  ;; Insert the candidate when previewing
  (corfu-preview-current 'insert)

  ;; Disable the return key
  :bind (:map corfu-map ("RET" . nil))

  ;; Function to enable corfu in the minibuffer
  ;; if other completion plugins are not active
  :init (defun hanker/corfu-always-enable-in-minibuffer ()
          "Enable Corfu in the minibuffer if Vertico/Mct are not active."
          (unless (or (bound-and-true-p mct--active)
                      (bound-and-true-p vertico--input)
                      (eq (current-local-map) read-passwd-map))

            ;; Disable automatic echo and popup
            (setq-local corfu-echo-delay nil
                        corfu-popupinfo-delay nil)

            ;; Enable corfu
            (corfu-mode)))

  ;; Enable corfu in the minibuffer
  ;; if other completion plugins are not active
  :hook (minibuffer-setup . hanker/corfu-always-enable-in-minibuffer)

  ;; Configure corfu
  :config

  ;; Enable corfu everywhere
  (global-corfu-mode)

  ;; Show documentation using the corfu pop up info extension
  (corfu-popupinfo-mode)

  ;; Save completion history for better sorting
  (corfu-history-mode)
  (savehist-mode)
  (add-to-list 'savehist-additional-variables 'corfu-history))
