.config/emacs/config.el

(use-package kind-icon

  ;; Load kind icons after corfu and nerd icons
  :after (corfu nerd-icons)

  ;; Customise corfu
  :custom

  ;; Don't use SVG based icons from kind icons
  (kind-icon-use-icons nil)

  ;; Use nerd font icons instead
  (kind-icon-mapping
   `(
     (array, (nerd-icons-mdicon "nf-md-code_brackets") :face font-lock-type-face)
     (boolean, (nerd-icons-faicon "nf-fa-toggle_off") :face font-lock-builtin-face)
     (class, (nerd-icons-mdicon "nf-md-shape") :face font-lock-type-face)
     (color, (nerd-icons-mdicon "nf-md-palette") :face success)
     (constant, (nerd-icons-mdicon "nf-md-pi") :face font-lock-constant-face)
     (constructor, (nerd-icons-faicon "nf-fae-tools") :face font-lock-function-name-face)
     (enum, (nerd-icons-faicon "nf-fa-arrow_down_a_z") :face font-lock-builtin-face)
     (enummember, (nerd-icons-faicon "nf-fa-arrow_down_a_z") :face font-lock-builtin-face)
     (enum-member, (nerd-icons-faicon "nf-fa-arrow_down_a_z") :face font-lock-builtin-face)
     (event, (nerd-icons-faicon "nf-fa-bolt") :face font-lock-warning-face)
     (field, (nerd-icons-mdicon "nf-md-tag_plus") :face font-lock-variable-name-face)
     (file, (nerd-icons-mdicon "nf-md-file_document") :face font-lock-string-face)
     (folder, (nerd-icons-mdicon "nf-md-folder") :face font-lock-doc-face)
     (function, (nerd-icons-mdicon "nf-md-function") :face font-lock-function-name-face)
     (interface, (nerd-icons-faicon "nf-fa-sitemap") :face font-lock-type-face)
     (keyword, (nerd-icons-mdicon "nf-md-key_chain_variant") :face font-lock-keyword-face)
     (macro, (nerd-icons-faicon "nf-fa-maxcdn") :face font-lock-keyword-face)
     (magic, (nerd-icons-mdicon "nf-md-magic_staff") :face font-lock-builtin-face)
     (method, (nerd-icons-octicon "nf-oct-package") :face font-lock-function-name-face)
     (module, (nerd-icons-mdicon "nf-md-view_module_outline") :face font-lock-preprocessor-face)
     (numeric, (nerd-icons-mdicon "nf-md-numeric") :face font-lock-builtin-face)
     (operator, (nerd-icons-codicon "nf-cod-symbol_operator") :face font-lock-comment-delimiter-face)
     (param, (nerd-icons-mdicon "nf-md-format_title") :face default)
     (property, (nerd-icons-faicon "nf-fa-wrench") :face font-lock-variable-name-face)
     (reference, (nerd-icons-octicon "nf-oct-file_symlink_file") :face font-lock-variable-name-face)
     (snippet, (nerd-icons-faicon "nf-fa-scissors") :face font-lock-string-face)
     (string, (nerd-icons-codicon "nf-cod-case_sensitive") :face font-lock-string-face)
     (struct, (nerd-icons-mdicon "nf-md-database") :face font-lock-variable-name-face)
     (text, (nerd-icons-sucicon "nf-custom-default") :face font-lock-doc-face)
     (typeparameter, (nerd-icons-codicon "nf-cod-symbol_parameter") :face font-lock-type-face)
     (type-parameter, (nerd-icons-codicon "nf-cod-symbol_parameter") :face font-lock-type-face)
     (unit, (nerd-icons-faicon "nf-fa-ruler") :face font-lock-constant-face)
     (value, (nerd-icons-mdicon "nf-md-alphabetical_variant") :face font-lock-builtin-face)
     (variable, (nerd-icons-mdicon "nf-md-variable") :face font-lock-variable-name-face)
     (t, (nerd-icons-faicon "nf-fa-code") :face font-lock-warning-face)

     ;; This is here to follow the Neovim ordering
     (command, (nerd-icons-faicon "nf-fa-terminal") :face default)))

  ;; Have the background be the same as corfu's default
  (kind-icon-default-face 'corfu-default)

  ;; Configure kind icon
  :config

  ;; Enable kind icon with corfu
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
