.config/emacs/config.org
*** Cape
Cape is a plugin that provides extensions to completion at point plugins like Corfu or Company.
#+begin_src emacs-lisp
(use-package cape

  ;; Configure cape
  :config

  ;; Function to check if the current buffer is not a minibuffer
  (defun hanker/not-in-minibuffer (&rest _)
    "Check if the current buffer is not a minibuffer"
    (not (minibufferp)))

  ;; Merge the static completion functions together
  (defalias 'hanker/static-completion-functions

    ;; Cache bust the merged completion functions
    (cape-capf-buster
     (cape-capf-super
      #'cape-sgml

      ;; Enable the emoji completion when the buffer is not a minibuffer
      ;; and silence the errors from it.
      ;;
      ;; I have no idea what is causing the errors, but it seems to be something
      ;; regarding using cape-capf-super to combine the cape-emoji completion function
      ;; predicated to only enable in minibuffers.
      ;;
      ;; Using the predicated cape-emoji completion function by itself
      ;; without combining it with other static completion functions
      ;; seem to work just fine, so this is really weird.
      ;;
      ;; I'm assuming the predicated version probably changes the function to not
      ;; be static or something, because I keep getting a error,
      ;; (wrong-number-of-arguments (1 . 1), 2), which means the calling function is
      ;; somehow passing two arguments when the predicated cape-emoji function only expects 1,
      ;; and this only happens in the minibuffer for some reason, the completion in regular
      ;; buffers still work just fine, which is exactly what I want.
      ;; Hence I'm just going to silence the error and not deal with it.
      ;;
      (cape-capf-silent (cape-capf-predicate #'cape-emoji #'hanker/not-in-minibuffer))
      #'cape-rfc1345
      #'cape-keyword
      #'cape-history
      #'cape-dabbrev
      #'cape-line

      ;; The elisp completions work in text and org mode
      ;; instead of in Elisp mode, so I have no use for it.
      ;;
      ;; I believe cape-elisp-symbol also wraps the symbol
      ;; in code blocks, which is also not what I want since
      ;; I want it to complete inside org mode source blocks.
      ;;
      ;; #'cape-elisp-block
      ;; #'cape-elisp-symbol

      ;; I don't have a dictionary file or an abbreviations file,
      ;; so there's no point enabling these two completions.
      ;;
      ;; #'cape-abbrev
      ;; #'cape-dict

      ;; This completion inserts the unicode
      ;; character for the LaTeX command,
      ;; not the full LaTeX command, so I
      ;; never want it, as LaTeX doesn't
      ;; support unicode and will error out.
      ;;
      ;; #'cape-tex
      )))

  ;; Function to add the general completion functions
  (defun hanker/add-general-completion-functions ()
    "Function to add the general completion functions."


    ;; Add the file completion at a depth of -90/100, so that
    ;; it comes before any completion function
    (add-hook 'completion-at-point-functions #'cape-file -90)
    (add-hook 'completion-at-point-functions #'hanker/static-completion-functions)
    )

  ;; Function to add file and dabbrev
  ;; and dabbrev completion as fallback
  (defun hanker/add-file-and-dabbrev-completions ()
    "Function to add file completion as first priority and dabbrev as a fallback."

    ;; Add the file completion at a depth of -90/100, so that
    ;; it comes before any completion function
    (add-hook 'completion-at-point-functions #'cape-file -90)

    ;; Add dabbrev completion as a fallback.
    ;; The 90 means the function depth is 90/100, which means
    ;; the dabbrev completion is near the end of the list.
    (add-hook 'completion-at-point-functions #'cape-dabbrev 90))

  ;; Function to set up completion for LSP mode
  (defun hanker/cape-lsp-completion-mode-setup ()
    "Function to set up completions for LSP mode"

    ;; Replace the default lsp-completion-at-point with
    ;; the cache busted version
    (setf (elt (cl-member 'lsp-completion-at-point completion-at-point-functions) 0)
          (cape-capf-buster #'lsp-completion-at-point))

    ;; Call the function to add file and dabbrev completions
    (hanker/add-file-and-dabbrev-completions))

  ;; Hooks for cape
  :hook

  ;; Add the wanted completion functions in text and org modes
  ((text-mode org-mode) . hanker/add-general-completion-functions)

  ;; Setup the completion functions in LSP mode
  (lsp-completion-mode . hanker/cape-lsp-completion-mode-setup)

  ;; Add file and dabbrev completions in programming mode
  (prog-mode . hanker/add-file-and-dabbrev-completions))
#+end_src

** Wgrep
Wgrep stands for writable grep, and it augments the ~grep~ buffer in Emacs so that it becomes writable, and changes to the buffer will affect the files as well. It is similar to the [[https://github.com/stevearc/quicker.nvim][quicker.nvim]] plugin for the Neovim quick fix list.
#+begin_src emacs-lisp
(use-package wgrep)
#+end_src

* Embark
Embark is a plugin that essentially gives you a keyboard-based right click menu everywhere in Emacs, allowing you to easily operate on items in the buffer.
#+begin_src emacs-lisp
(use-package embark

  ;; Lazy load embark
  :commands (embark-act embark-dwim embark-bindings)

  ;; Customise embark
  :custom

  ;; Set the help key to ?
  (embark-help-key "?")

  ;; Replace the prefix help command
  ;; with embark's completing-read interface
  (prefix-help-command #'embark-prefix-help-command)

  ;; Key binds for embark
  :general (general-def
             "M-;" '("Run the default action" . embark-dwim)

             ;; Load consult before opening embark
             "C-;" '("Open embark" .
                     (lambda () (interactive)
                       (require 'consult)
                       (embark-act))))

  ;; Remap the describe bindings function to embark's
  :bind ([remap describe-bindings] . embark-bindings))
#+end_src

** Integration with consult
#+begin_src emacs-lisp
(use-package embark-consult
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

* Helpful
Helpful is a better help buffer for Emacs that provides more context and details.
#+begin_src emacs-lisp
(use-package helpful

  ;; Remap the default Emacs commands to the helpful versions
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))
#+end_src

* Git integration
Magit is an awesome plugin that provides excellent Git integration in Emacs.
#+begin_src emacs-lisp
(use-package magit

  ;; Load magit only when its status command is called
  :commands (magit magit-status)

  ;; Key binds for magit
  :general
  (hanker/leader-keys
    :states 'normal
    "gs" '("Open Git" . magit-status)
    )
  )

;; Ensure transient is updated as well,
;; as it is a magit dependency
(use-package transient)
#+end_src

* Org mode

** Enable the table of contents
#+begin_src emacs-lisp
(use-package toc-org

  ;; Only load the package after org mode
  :after org

  ;; Load toc-org only when its enable command is called
  :commands toc-org-enable

  ;; Create the function to fix org-open-at-point-global.
  ;;
  ;; This is particularly useful when following toc-org links
  ;; which don't work with org-open-at-point-global.
  :init (defun hanker/fixed-org-open-at-point-global ()
          "Fix the org-open-at-point-global function to fallback to org-open-at-point when in Org mode"
          (interactive)
          (condition-case _ (org-open-at-point-global)
            (error
             (if (eq major-mode 'org-mode)
                 (org-open-at-point)))))

  ;; Rebind the org-open-at-point-global
  ;; function to the fixed version
  :bind ([remap org-open-at-point-global] . hanker/fixed-org-open-at-point-global)

  ;; Enable toc-org in org mode
  :hook (org-mode . toc-org-enable))
#+end_src

** Installing Org Modern
Org-modern is a plugin that prettifies org mode to look more modern.
#+begin_src emacs-lisp
(use-package org-modern

  ;; Only load the package after org mode
  :after org

  ;; Customise org mode settings to work with org modern
  :custom

  ;; Disable auto alignment of tags,
  ;; as this will break org modern's
  ;; auto alignment of tags
  (org-auto-align-tags nil)

  ;; Set the tags column to 0,
  ;; since org mode isn't responsible for
  ;; aligning the tags any more
  (org-tags-column 0)

  ;; Set the org agenda tag column to 0
  ;; as again, org mode isn't responsible for
  ;; aligning the tags any more
  (org-agenda-tags-column 0)

  ;; Use the bullets style for the stars
  ;; instead of the default fold indicators
  (org-modern-star 'replace)

  ;; Hooks for org modern
  :hook

  ;; Enable org indent mode, followed
  ;; by org modern mode.
  ;;
  ;; Org indent mode must be enabled first,
  ;; before org modern mode, otherwise org indent mode
  ;; will not apply to source blocks and make
  ;; the org document look really weird.
  ;;
  ;; Note that this disables org modern's
  ;; the source block prettification on the fringe.
  ;;
  ;; However, that is fine since I have
  ;; line numbers on the side,
  ;; so it doesn't look nice anyway.
  (org-mode . (lambda ()
                (org-indent-mode)
                (global-org-modern-mode)))

  ;; Set the line spacing to 0.25 in org mode
  ;; to have org modern display the tags nicely
  (org-mode . (lambda () (setq-local line-spacing 0.25))))
#+end_src

