.config/emacs/config.org
** Disabling electric indent
Org mode source code blocks have some really weird and annoying default indentation behaviour. It is likely due to ~electric-indent-mode~, which is turned on by default in Emacs. So I'm going to turn it off.
#+begin_src emacs-lisp
(electric-indent-mode -1)
#+end_src

** Stopping org mode from indenting 2 spaces in code blocks
#+begin_src emacs-lisp
(setq org-edit-src-content-indentation 0)
#+end_src

** Enabling Org Tempo
Org-tempo provides shortcuts for various expansions in Org mode, such as "<s" to create a source code block. Below are shortcuts for ~org-tempo~.

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src

** Stop auto completing "<" in org mode
Electric pair mode auto completes the "<" in org mode, which causes issues with the org tempo expansions. The code below stops electric pair mode from auto completing "<" in org mode.
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda ()
                           (setq-local electric-pair-inhibit-predicate
                                       `(lambda (c)
                                          (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
#+end_src

** Add a page break immediately after the table of contents in LaTeX
#+begin_src emacs-lisp
(setq org-latex-toc-command "\\tableofcontents \\clearpage")
#+end_src

** Evil Org
Evil org provides a set of evil key bindings that work with org mode.
#+begin_src emacs-lisp
(use-package evil-org

  ;; Only load the package after org mode
  :after org

  ;; Start evil org when org mode is started
  :hook (org-mode . (lambda () (evil-org-mode)))

  ;; Configure evil org
  :config

  ;; Set the key bindings for org agenda
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src

** Turn on LaTeX syntax highlighting in org mode
This sets the variable ~org-highlight-latex-and-related~ to "native", which will highlight LaTeX syntax like it is a TeX file. The "latex" setting will just highlight all LaTeX fragments in a different colour. So a LaTeX block will just be one colour and all the entities are not highlighted. For the other options, the Emacs help (~C-h v org-highlight-latex-and-related~) should be sufficient to understand what they do.
#+begin_src emacs-lisp
(setq org-highlight-latex-and-related '(native))
#+end_src

** Add syntax highlighting to LaTeX exports of org mode code blocks
This allows the code blocks in Org mode to have syntax highlighting when it is being exported to LaTeX.
#+begin_src emacs-lisp
;; Add the minted LaTeX package
;; to the header of all Org mode LaTeX exports
(add-to-list 'org-latex-packages-alist '("" "minted"))

;; Use the minted LaTeX package for source code blocks
;; instead of the default LaTeX verbatim block
(setq org-latex-listings 'minted)

;; Add the shell escape to the latexmk command
(setq org-latex-pdf-process '("latexmk -shell-escape -f -pdf -%latex -interaction=nonstopmode -output-directory=%o %f"))
#+end_src

** Citeproc
Citeproc is a program that produces formatted bibliographies and citations using the Citation Style Language (CSL) styles.
#+begin_src emacs-lisp
(use-package citeproc)
#+end_src

** Literate programming
Literate programming is a way of programming that has code snippets embedded in text that explain the code, and looks something like this configuration file.

*** Org export to Jupyter Notebooks
Install ~ox-ipynb~ to support exporting org files to Jupyter Notebooks, which have the file extension ~ipynb~.
#+begin_src emacs-lisp
(use-package ox-ipynb

  ;; Install the package from GitHub
  :ensure (ox-ipynb :host github :repo "jkitchin/ox-ipynb")

  ;; Only load the package after org mode
  :after org)
#+end_src

*** Emacs Jupyter
Emacs Jupyter is a plugin to work with Jupyter kernels inside org mode.
#+begin_src emacs-lisp
(use-package jupyter

  ;; Load the Jupyter languages
  :init (org-babel-do-load-languages
         'org-babel-load-languages
         '((emacs-lisp . t)
           (python . t)
           (jupyter . t)))

  ;; Add a hook to redisplay inline images
  ;; after executing a code block
  :hook (org-babel-after-execute . org-redisplay-inline-images))
#+end_src

*** Stop org mode from asking me to confirm evaluation
#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src

* LaTeX

** AUCTeX
AUCTeX is an Emacs package for writing LaTeX documents.
#+begin_src emacs-lisp
(use-package auctex :defer t
  :ensure (:pre-build (("./autogen.sh")
                       ("./configure"
                        "--without-texmf-dir"
                        "--with-packagelispdir=./"
                        "--with-packagedatadir=./")
                       ("make"))
                      :build (:not elpaca--compile-info)
                      :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
                      :version (lambda (_) (require 'auctex) AUCTeX-version))

  ;; Enable prettify symbols mode in TeX mode
  :hook (TeX-mode . prettify-symbols-mode))
#+end_src

** Evil TeX
Evil TeX provides useful text objects for LaTeX editing.
#+begin_src emacs-lisp
(use-package evil-tex

  ;; Ensure that auctex is installed
  :after auctex

  ;; Enable evil tex in latex mode
  :hook (LaTeX-mode . evil-tex-mode))
#+end_src

** PDF Tools
PDF Tools is a great plugin that makes working with PDFs very easy. A lot of times, I am exporting org files or TeX files to PDF, so this makes my life much easier. It makes use of the ~poppler~ library, so make sure to have that installed.
#+begin_src emacs-lisp
(use-package pdf-tools

  ;; Customise to use PDF tools to open
  ;; LaTeX PDF files
  :custom
  (TeX-view-program-selection '((output-pdf "PDF Tools")))
  (TeX-source-correlate-start-server t)

  ;; Update PDF buffers after successful LaTeX runs
  :init (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)

  ;; Install pdf-tools
  :config (pdf-tools-install))
#+end_src

** Revert without querying
This is to stop Emacs from asking if I want to reread the PDF file from disk every time I reopen a PDF file that has changed. Instead, Emacs will now just automatically reread the PDF file without asking.
#+begin_src emacs-lisp
(setq revert-without-query '(".pdf"))
#+end_src

* Building better Vim habits

** Hardtime
Hardtime is a package that forces you to stop repeating the same commands to move around in Emacs.
#+begin_src emacs-lisp
(use-package hardtime

  ;; Install the package from GitHub
  :ensure (hardtime :host github :repo "ichernyshovvv/hardtime.el")

  ;; Define the evil hardtime check command function
  :init (defun hanker/evil-hardtime-check-command ()
          "Return non-nil if the currently executed command should be checked."
          (memq this-command '( next-line previous-line evil-previous-visual-line
                                right-char left-char left-word right-word
                                evil-forward-char evil-backward-char
                                evil-next-line evil-previous-line)))

  ;; Customise hardtime.el
  :custom

  ;; Set the hardtime period to 1 second
  (hardtime-period 1)

  ;; Use the evil hardtime check command instead
  (hardtime-predicate #'hanker/evil-hardtime-check-command)

  ;; Enable hardtime mode in programming, text and org mode
  :hook ((prog-mode text-mode org-mode) . hardtime-mode))
#+end_src

* External programs
Below is a list of external programs that are being used with my Emacs configuration.

** Language servers
- [[https://aur.archlinux.org/packages/efm-langserver][efm-langserver]]
- [[https://aur.archlinux.org/packages/ltex-ls-plus-bin][ltex-plus]]
- [[https://aur.archlinux.org/packages/basedpyright][basedpyright]]

** Formatters and linters
- [[https://github.com/astral-sh/ruff][Ruff]]

** TeX and LaTeX
- [[https://tug.org/texlive][texlive-basic]]
- [[https://tug.org/texlive][texlive-bin]]
- [[https://tug.org/texlive][texlive-binextra]]
- [[https://tug.org/texlive][texlive-fontsextra]]
- [[https://tug.org/texlive][texlive-fontsrecommended]]
- [[https://tug.org/texlive][texlive-latex]]
- [[https://tug.org/texlive][texlive-latexextra]]
- [[https://tug.org/texlive][texlive-latexrecommended]]
- [[https://tug.org/texlive][texlive-mathscience]]
- [[https://tug.org/texlive][texlive-pictures]]
- [[https://tug.org/texlive][texlive-plaingeneric]]

** Miscellaneous
- [[https://github.com/BurntSushi/ripgrep][ripgrep (for searching within files)]]
- [[https://gitlab.freedesktop.org/poppler/poppler][poppler (for PDF Tools)]]
- [[https://github.com/jupyter/notebook][Jupyter Notebook (for literate programming)]]
