.config/emacs/config.el

(electric-indent-mode -1)

(setq org-edit-src-content-indentation 0)

(require 'org-tempo)

(add-hook 'org-mode-hook (lambda ()
                           (setq-local electric-pair-inhibit-predicate
                                       `(lambda (c)
                                          (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

(setq org-latex-toc-command "\\tableofcontents \\clearpage")

(use-package evil-org

  ;; Only load the package after org mode
  :after org

  ;; Start evil org when org mode is started
  :hook (org-mode . (lambda () (evil-org-mode)))

  ;; Configure evil org
  :config

  ;; Set the key bindings for org agenda
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(setq org-highlight-latex-and-related '(native))

;; Add the minted LaTeX package
;; to the header of all Org mode LaTeX exports
(add-to-list 'org-latex-packages-alist '("" "minted"))

;; Use the minted LaTeX package for source code blocks
;; instead of the default LaTeX verbatim block
(setq org-latex-listings 'minted)

;; Add the shell escape to the latexmk command
(setq org-latex-pdf-process '("latexmk -shell-escape -f -pdf -%latex -interaction=nonstopmode -output-directory=%o %f"))

(use-package citeproc)

(use-package ox-ipynb

  ;; Install ox-ipynb from GitHub
  :ensure (ox-ipynb :host github :repo "jkitchin/ox-ipynb")

  ;; Only load the package after org mode
  :after org)

(use-package jupyter

  ;; Load the Jupyter languages
  :init (org-babel-do-load-languages
         'org-babel-load-languages
         '((emacs-lisp . t)
           (python . t)
           (jupyter . t)))

  ;; Add a hook to redisplay inline images
  ;; after executing a code block
  :hook (org-babel-after-execute . org-redisplay-inline-images))

(setq org-confirm-babel-evaluate nil)

(use-package auctex :defer t
  :ensure (:pre-build (("./autogen.sh")
                        ("./configure"
                         "--without-texmf-dir"
                         "--with-packagelispdir=./"
                         "--with-packagedatadir=./")
                        ("make"))
            :build (:not elpaca--compile-info)
            :files ("*.el" "doc/*.info*" "etc" "images" "latex" "style")
            :version (lambda (_) (require 'auctex) AUCTeX-version))
  :mode (("\\.tex\\'" . LaTeX-mode)))

(use-package evil-tex

  ;; Ensure that auctex is installed
  :after auctex

  ;; Enable evil tex in latex mode
  :hook (LaTeX-mode . evil-tex-mode))

(use-package pdf-tools

  ;; Customise to use PDF tools to open
  ;; LaTeX PDF files
  :custom
  (TeX-view-program-selection '((output-pdf "PDF Tools")))
  (TeX-source-correlate-start-server t)

  ;; Update PDF buffers after successful LaTeX runs
  :init (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)

  ;; Install pdf-tools
  :config (pdf-tools-install))

(setq revert-without-query '(".pdf"))

(use-package hardtime

  ;; Install hardtime.el from GitHub
  :ensure (hardtime :host github :repo "ichernyshovvv/hardtime.el")

  ;; Define the evil hardtime check command function
  :init (defun hanker/evil-hardtime-check-command ()
          "Return non-nil if the currently executed command should be checked."
          (memq this-command '( next-line previous-line evil-previous-visual-line
                                right-char left-char left-word right-word
                                evil-forward-char evil-backward-char
                                evil-next-line evil-previous-line)))

  ;; Customise hardtime.el
  :custom

  ;; Set the hardtime period to 1 second
  (hardtime-period 1)

  ;; Use the evil hardtime check command instead
  (hardtime-predicate #'hanker/evil-hardtime-check-command)

  ;; Enable hardtime mode in programming, text and org mode
  :hook ((prog-mode text-mode org-mode) . hardtime-mode))
